# Pandas

In [3]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [17]:
label=['a','b','c','d','e']
my_data=[1,2,3,4,5]
arr=np.array(my_data)
d={'a':1,'b':2,'c':3,'d':4,'e':5}

In [19]:
pd.Series(data=my_data,index=label)  #data ve index yazmaya gerek yok

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [20]:
pd.Series(d)  #dictionary i direkt kullanabiliyor

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [22]:
pd.Series([sum,len]) #built in referans tutuyor

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [30]:
seri=pd.Series([1,2,3],['malatya','istanbul','ankara'])  #eşit sayıda olması gerekir
seri
seri2=pd.Series([1,2,3],['malatya','istanbul','izmir'])
seri+seri2                    #Floata cevirir data type ı ve karşıda aynı değerler yoksa NaN olur

ankara      NaN
istanbul    4.0
izmir       NaN
malatya     2.0
dtype: float64

# Dataframes

In [3]:
np.random.seed(101)

In [4]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [11]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [12]:
df['NEW']=df['W']+df['Y']

In [13]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('NEW',axis=1)   #buradan sonra df i tekrar çekersek new kolonu gözükür silinmesi için inplace metodu true olması gerekir

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('E')   #Row da axis belirtmeden silinebilir ve kesin ise inplace metodu true olmalıdır

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [21]:
df.shape

(5, 5)

In [25]:
#Selecting rows
df.loc['E']   #seri olarak döner

W      0.190794
X      1.978757
Y      2.605967
Z      0.683509
NEW    2.796762
Name: E, dtype: float64

In [24]:
df.iloc[3]  #index ile de çağrılabilir

W      0.188695
X     -0.758872
Y     -0.933237
Z      0.955057
NEW   -0.744542
Name: D, dtype: float64

In [26]:
df.loc['B','Y']    #lokasyon belirtirsek oradaki değeri bize döndürür

-0.8480769834036315

In [30]:
df.loc[['A','B'],['W','Z']]   # sütun ve satır dizisi oluşturarak altküme veri seti döndürebiliriz

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965

In [36]:
#Conditional Selection
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df[['X','Y']]>0   #Boolean döner

       X      Y
A   True   True
B  False  False
C   True   True
D  False  False
E   True   True

In [71]:
df[df['X']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
C  0.740122  0.528813
E  1.978757  2.605967

In [80]:
df[(df['W']>0) & (df['Y']>0)] # multiple condition

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [ ]:
df.reset_index() #var olan indeksi column olarak atar ve indeksi nümeric yapar. Kesinlik için inplace kullanılmalı

In [ ]:
df.set_indeks('colon adı')  #var olan kolonu indeks olarak atar. Kesinlik için inplace kullanılmalı

# Multindex

In [83]:
outside=['G1','G1','G1','G2','G2','G2',]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [84]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [85]:
df2=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [86]:
df2

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [88]:
df2.loc['G1'].loc[3]['B']     # Spesifik lokasyona ulaşma

0.39052784273374097

In [90]:
 df2.index.names=['Groups','NUM'] #ile indekslere isim verebiliriz

In [91]:
df2

                   A         B
Groups NUM
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [93]:
df2.xs(1,level='NUM') #xs cross section olarak işimizi görüyor

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [27]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [29]:
df3=pd.DataFrame(d)
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [98]:
df3.dropna()   #nanları düşürür

     A    B  C
0  1.0  5.0  1

In [30]:
df3.dropna(thresh=2)  # bir satıda en az bir tane düzgün veri getir demek

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [102]:
df3.fillna(value='Missing!')

          A         B  C
0         1         5  1
1         2  Missing!  2
2  Missing!  Missing!  3

In [104]:
df3['A'].fillna(value=df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Group By

In [3]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df=pd.DataFrame(data)

In [6]:
bycount=df.groupby('Company')   #objeyi oluşturuyoruz kullanmamız gerekecek

In [7]:
bycount.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [8]:
bycount.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
bycount.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [11]:
bycount.mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [30]:
bycount.mean()>162# Yine true false döner   #BURAYA BAK

  Company Person  Sales
0     NaN    NaN    NaN
1     NaN    NaN    NaN
2     NaN    NaN    NaN
3     NaN    NaN    NaN
4     NaN    NaN    NaN
5     NaN    NaN    NaN

In [17]:
bycount.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [24]:
bycount.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [34]:
bycount.cumsum()

   Sales
0    200
1    320
2    340
3    464
4    243
5    593

# Merging,Joining, Concatenating

In [35]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [36]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [43]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [44]:
pd.concat([df1,df2,df3])   #Dimensionslar kesin birbirini tutmalı eğer farklı kolonvarsa yanda açıyor

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [45]:
pd.concat([df1,df2,df3],axis=1)   #Yatay hale getirdik

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [46]:
#MERGE

left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [50]:
pd.merge(left,right,how= 'inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [59]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [60]:
pd.merge(left, right, how='inner', on=['key1', 'key2'])  #keyler bir çiftse 1 kere veriyoar ama birden fazla ise ona göre yer veriyor.

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [61]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [62]:
#JOINING

left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [65]:
left.join(right,how='outer') #DEFAULT : LEFT JOIN

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

In [14]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()   #defaultu 5 satır gösteriyor   tail son 5 i

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [74]:
df['col2'].unique()  #array olarak uniqeifadeleri döner nunique sayı döner

array([444, 555, 666], dtype=int64)

In [31]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [76]:
df['col2'].value_counts()  #her  değerin karşısında ne kadar satı var ise onu döner

444    2
555    1
666    1
Name: col2, dtype: int64

In [78]:
#Selecting
df[(df['col1']>2) &(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [79]:
def times2(x):
    return x*2
df['col1'].apply(times2)   #Fonksiyonları böyle uygulayabiliriz

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [ ]:
df['col3'].apply(len) #built in functionları da olabilir

In [ ]:
#Removing
# del df['col1']     kalıcı silmek için

In [ ]:
df.columns
df.index

In [24]:
df.sort_values(by='col2') #inplace=False by default ascending bool değer ile ayarlanabilir

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [ ]:
df.isnull() # Null value bulma 1 0 df getirir

In [26]:
#Row oluşturma 
new_row=pd.DataFrame({"col1":1,'col2':2,'col3':'3'},index=['Surname'])
df.append(new_row)

         col1  col2 col3
0           1   444  abc
1           2   555  def
2           3   666  ghi
3           4   444  xyz
Surname     1     2    3

In [ ]:
# Drop rows with NaN Values
#df.dropna()

In [4]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [7]:
df.drop('col1',axis=1) # inplace falsa olduğu sürece bir değişkene atayıp droplu halini kullanabiliriz

    col2 col3
0    NaN  abc
1  555.0  def
2  666.0  ghi
3  444.0  xyz

In [9]:
max(df)

'col3'

In [82]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [89]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [90]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# DATA INPUT OUTPUT

In [91]:
# pwd lokasyonu veriyor okurken yazarken aynı adreste olması gerekir

'C:\\Users\\ufukk\\Desktop\\PythonDS\\PythonDataScienceandML'

# CSV

In [98]:
#df=pd.read_csv('dam_occupancy.csv',usecols= ,squeezee =True) olursa colonları liste olarak yazarak series olarak çalışabiliriz

In [ ]:
df=pd.read_csv('dam_occupancy.csv')

In [100]:
df.head()

         DATE  GENERAL_DAM_OCCUPANCY_RATE  GENERAL_DAM_RESERVED_WATER
0  2005-01-01                       44.62                         388
1  2005-01-02                       44.62                         388
2  2005-01-03                       44.47                         386
3  2005-01-04                       44.42                         386
4  2005-01-05                       44.35                         385

In [ ]:
#df.to_csv('dosyaismiuzantı',index=False) indeksi false yapmazsak kaydettiğimiz dosyada indeks ayrı bir kolon olarak gözükür.

# Excel

In [103]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1') # her sheeti farklı bir df olarak algılar

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [ ]:
#df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

## HTML
​
You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:
​
    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4
​
Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)
​
Pandas can read table tabs off of html. For example:

In [5]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

ValueError: No tables found

# SQL

read_sql_table(table_name, con[, schema, ...])
Read SQL database table into a DataFrame.
read_sql_query(sql, con[, index_col, ...])
Read SQL query into a DataFrame.
read_sql(sql, con[, index_col, ...])
Read SQL query or database table into a DataFrame.
DataFrame.to_sql(name, con[, flavor, ...])
Write records stored in a DataFrame to a SQL databa

In [ ]:
# import pandas as pd, pyodbc    
# con_string = 'DRIVER={SQL Server};SERVER='+ <server> +';DATABASE=' + <database>
# cnxn = pyodbc.connect(con_string)
# query = """
#   SELECT <field1>, <field2>, <field3>
#   FROM result
# """
# result_port_map = pd.read_sql(query, cnxn)
# result_port_map.columns.tolist()

In [ ]:
# Additionally, if you are connecting to a MySQL database, you need to install the “pymysql” package.
# However, for PostgreSQL, I am going to install the “psycopg2”

In [6]:
from sqlalchemy import create_engine

In [17]:
engine = create_engine('sqlite:///:memory:')

In [8]:
df.to_sql('data', engine)

NameError: name 'df' is not defined

In [18]:
sql_df = pd.read_sql('SQLQuery1',con=engine)

OperationalError: (sqlite3.OperationalError) near "SQLQuery1": syntax error
[SQL: SQLQuery1]
(Background on this error at: http://sqlalche.me/e/13/e3q8)